Lectures/lectures/bookstore/app/controllers/books_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" IN ($1, $2, $3, $4, $5)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5]]
SELECT "books".* FROM "books"
---
  def index
    @books = Book.includes(:author).all